tutorial/3Dchannel/0/A2
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "";
    case "";
    instance "";
    local "";

    class volSymmTensorField;
    object A2;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField    uniform  (0.3333333333333333 0 0 0.3333333333333333 0 0.3333333333333333);
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform  (0.3333333333333333 0 0 0.3333333333333333 0 0.3333333333333333);
    }
    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
