tutorial/3Dchannel/0/StressFiber
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "cylinder3";
    instance        "0";
    local           "";

    class           volTensorField;
    object          StressFiber;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0);
//internalField   uniform (0 0 0 0 0 0 0 0 0);

boundaryField
{
    inlet      
    {
//        type            fixedValue;
 //       value           uniform (0 0 0 0 0 0 0 0 0);
	type zeroGradient;    
	}
	outlet
	{
  //      type            fixedValue;
  //      value           uniform (0 0 0 0 0 0 0 0 0);
	type zeroGradient;	
	}

    fixedWalls      
    {
//        type            fixedValue;
//	value    uniform (0 0 0 0 0 0 0 0 0);
	type zeroGradient;
    }
cylinder
    {
	type zeroGradient;
    }

    frontAndBack    
    {
        type            empty;
    }
}


// ************************************************************************* //
