tutorial/3Dchannel/Allrun
#!bin/sh

blockMesh
icoFiberFoam
